In [20]:
import pandas as pd; import numpy as np

In [21]:
df = pd.DataFrame([[2.4,np.nan],
                 [6.3,-5.4],
                 [np.nan,np.nan],
                 [0.75,-1.3]],
                 index=list("abcd"), columns=["Bir","İki"])
df

    Bir  İki
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3


### Artimetik fonksiyonlar stun bazlı işlem yapar. Satır bazlı işlem için `axis = 1` parametresi verilir. NaN değerlerin boş geçilmemesi için `skipna = False` parametresi verilir.

In [23]:
df.sum()

Bir    9.45
İki   -6.70
dtype: float64

In [24]:
df.sum(axis=1, skipna=False)

a     NaN
b    0.90
c     NaN
d   -0.55
dtype: float64

### Stundaki max değeri olan satırın indexini almak için `.idmax()` fonksiyonu kullanılır.

In [26]:
df.idxmax()

Bir    b
İki    d
dtype: object

In [27]:
df.idxmin()

Bir    d
İki    b
dtype: object

In [28]:
df.cumsum()

    Bir  İki
a  2.40  NaN
b  8.70 -5.4
c   NaN  NaN
d  9.45 -6.7

In [30]:
df.describe()

         Bir       İki
count  3.000  2.000000
mean   3.150 -3.350000
std    2.850  2.899138
min    0.750 -5.400000
25%    1.575 -4.375000
50%    2.400 -3.350000
75%    4.350 -2.325000
max    6.300 -1.300000

- ### Df içerisinde korelasyon sayısını bulmak için `.corr()` metotu bulunur. Bir stunun diğerleri ile olan ilişkişisi için `.corrwidth(<stun_adi>)` yapısı kullanılır.
- ### Df içerisinde kovaryasyon sayısını bulmak için `.covv()` metotu bulunur.

In [32]:
iris = pd.read_table("DataSets/iris.txt")

In [34]:
iris.head(15)

,Canak_yaprak_boyu,Canak_yaprak_eni,Tac_yaprak_boyu,Tac_yaprak_eni,Turu
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa
5,5.4,3.9,1.7,0.4,setosa
6,4.6,3.4,1.4,0.3,setosa
7,5.0,3.4,1.5,0.2,setosa
8,4.4,2.9,1.4,0.2,setosa
9,4.9,3.1,1.5,0.1,setosa
10,5.4,3.7,1.5,0.2,setosa
11,4.8,3.4,1.6,0.2,setosa
12,4.8,3.0,1.4,0.1,setosa
13,4.3,3.0,1.1,0.1,setosa
14,5.8,4.0,1.2,0.2,setosa

In [35]:
iris["Tac_yaprak_boyu"].corr(iris["Tac_yaprak_eni"])

0.9628654314027962

In [36]:
iris.corr()

,Canak_yaprak_boyu,Canak_yaprak_eni,Tac_yaprak_boyu,Tac_yaprak_eni
Canak_yaprak_boyu,1.000000,-0.117570,0.871754,0.817941
Canak_yaprak_eni,-0.117570,1.000000,-0.428440,-0.366126
Tac_yaprak_boyu,0.871754,-0.428440,1.000000,0.962865
Tac_yaprak_eni,0.817941,-0.366126,0.962865,1.000000

In [37]:
iris.cov()

,Canak_yaprak_boyu,Canak_yaprak_eni,Tac_yaprak_boyu,Tac_yaprak_eni
Canak_yaprak_boyu,0.685694,-0.042434,1.274315,0.516271
Canak_yaprak_eni,-0.042434,0.189979,-0.329656,-0.121639
Tac_yaprak_boyu,1.274315,-0.329656,3.116278,1.295609
Tac_yaprak_eni,0.516271,-0.121639,1.295609,0.581006

In [39]:
iris.corrwith(iris.Canak_yaprak_boyu)

Canak_yaprak_boyu    1.000000
Canak_yaprak_eni    -0.117570
Tac_yaprak_boyu      0.871754
Tac_yaprak_eni       0.817941
dtype: float64

In [40]:
s = pd.Series(["b","b","b","a","a","a","a","c","c","c","d","d","d","d","d"])
s

0     b
1     b
2     b
3     a
4     a
5     a
6     a
7     c
8     c
9     c
10    d
11    d
12    d
13    d
14    d
dtype: object

- #### Veri yapısı içerisinde benzersiz verileri bulmak için `.unique()` metotu kullanılır.
- #### Değerlerin kaç defa tekrar ettiğini bulmak içinse `.value_counts()` metotu kullanılır.
- #### Belirli değerler veri yapısı içerisinde olup olmadığını kontrol etmek için `.isin()` metotu kullanılır.

In [41]:
s.unique()

array(['b', 'a', 'c', 'd'], dtype=object)

In [42]:
s.value_counts()

d    5
a    4
b    3
c    3
dtype: int64

In [43]:
x = s.isin(["b","c"])
x

0      True
1      True
2      True
3     False
4     False
5     False
6     False
7      True
8      True
9      True
10    False
11    False
12    False
13    False
14    False
dtype: bool

In [44]:
s[x]

0    b
1    b
2    b
7    c
8    c
9    c
dtype: object